pipe-case/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         72;

deltaT          0.002;

adjustTimeStep  off;

writeControl	adjustableRunTime;

writeInterval	3;

purgeWrite      4;

writeFormat     ascii;

writePrecision  8;

writeCompression false;

timeFormat      general;

timePrecision   8;

runTimeModifiable true;

			


functions
{

fieldAverage1
    {
    type            fieldAverage;
    libs            ("libfieldFunctionObjects.so");
    executeControl      runTime;
    executeInterval     $deltaT;
    writeControl		adjustableRunTime;
    writeInterval       $writeInterval;
    timeStart			12;
    timeEnd				$endTime;
    restartOnRestart    no;
    restartOnOutput     no;
    fields
    (
        U
        {
            mean        yes;
            prime2Mean  yes;
            base        time;
        }
		nut
        {
            mean        yes;
            prime2Mean  no;
            base        time;
        }
        k
        {
            mean        yes;
            prime2Mean  no;
            base        time;
        }
        omega
        {
            mean        yes;
            prime2Mean  no;
            base        time;
        }

        p
        {
            mean        yes;
            prime2Mean  no;
            base        time;
        }
        
    );
    }
}

// ************************************************************************* //
