pipe-case/0/U
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \\    /   O peration     | Version:  2.3.1                                 | 
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      | 
|    \\/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    INLET
    {
        type			fixedValue;
        value           nonuniform List<vector> 
3180 
 (
(-0.06139938 0 0)
(-0.15476757 0 0)
(-0.21118477 0 0)
(-0.24530429 0 0)
(-0.26927541 0 0)
(-0.28812863 0 0)
(-0.30354448 0 0)
(-0.31717017 0 0)
...
); 
     }
 
    OUTLET 
    {
        type            zeroGradient;
    }

    WALL
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }

}

// ************************************************************************* // 
