pipe-case/0/k
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \\    /   O peration     | Version:  2.3.1                                 | 
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      | 
|    \\/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.0176;

boundaryField
{
    INLET
    {
        type			fixedValue;
        value           nonuniform List<scalar> 
3180 
 (
0.00003257
0.00048089
0.00088686
0.00105590
0.00113062
0.00116726
0.00118364
0.00118969
...
); 
     }
 
    OUTLET 
    {
        type            zeroGradient;
    }

    WALL
    {
        type            fixedValue;
        value           uniform 1e-40;
    }
}

// ************************************************************************* // 
