pipe-case/0/omega
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \\    /   O peration     | Version:  2.3.1                                 | 
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      | 
|    \\/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 5.33885;

boundaryField
{
    INLET
    {
        type			fixedValue;
        value           nonuniform List<scalar> 
3180 
 (
9749.81267161
1117.98630118
503.10184264
291.83191327
192.75970398
137.46658224
104.35343603
81.37593807
...
); 
     }
 
    OUTLET 
    {
        type            zeroGradient;
    }

    WALL
    {
        type            omegaWallFunction;
        value           uniform 1e4;
    }
}

// ************************************************************************* // 
